Oryx-Embedded/CycloneCRYPTO/hardware/pic32mz/pic32mz_crypto_pkc.c
void ba414eClearScm(void)
{
   uint_t i;
   volatile uint32_t *p;

   //Point to the SCM memory
   p = (uint32_t *) __CRYPTO1SCM_BASE;

   //The SCM memory contains 304 words of 64 bits
   for(i = 0; i < 608; i++)
   {
      p[i] = 0;
   }
}


/**
 * @brief Import byte array
 * @param[in] src Pointer to the byte array
 * @param[in] length Length of the array to be copied, in bytes
 * @param[in] slot SCM memory location
 **/

void ba414eImportArray(const uint8_t *src, size_t length, uint_t slot)
{
   uint_t i;
   uint_t j;
   uint32_t temp;
   volatile uint32_t *p;

   //Point to the specified SCM memory location
   p = BA414E_GET_SCM_SLOT(slot);

   //Copy the array to the SCM memory
   for(i = 0, j = 0; i < length; i++)
   {
      switch(i % 4)
      {
      case 0:
         temp = src[length - i - 1];
         break;
      case 1:
         temp |= src[length - i - 1] << 8;
         break;
      case 2:
         temp |= src[length - i - 1] << 16;
         break;
      default:
         temp |= src[length - i - 1] << 24;
         p[j++] = temp;
         break;
      }
   }

   //Pad the operand with zeroes
   for(; i < 64; i++)
   {
      switch(i % 4)
      {
      case 0:
         temp = 0;
         break;
      case 3:
         p[j++] = temp;
         break;
      default:
         break;
      }
   }
}


/**
 * @brief Import scalar
 * @param[in] src Pointer to the scalar
 * @param[in] length Length of the scalar, in words
 * @param[in] slot SCM memory location
 **/

void ba414eImportScalar(const uint32_t *src, uint_t length, uint_t slot)
{
   uint_t i;
   volatile uint32_t *p;

   //Point to the specified SCM memory location
   p = BA414E_GET_SCM_SLOT(slot);

   //Copy the scalar to the SCM memory
   for(i = 0; i < length; i++)
   {
      p[i] = src[i];
   }

   //Pad the operand with zeroes
   for(; i < 16; i++)
   {
      p[i] = 0;
   }
}


/**
 * @brief Import multiple-precision integer
 * @param[in] src Pointer to the multiple-precision integer
 * @param[in] size Size of the operand, in words
 * @param[in] slot SCM memory location
 **/

void ba414eImportMpi(const Mpi *src, uint_t slot)
{
   uint_t i;
   uint_t length;
   volatile uint32_t *p;

   //Get the actual length of the multiple-precision integer, in words
   length = mpiGetLength(src);

   //Point to the specified SCM memory location
   p = BA414E_GET_SCM_SLOT(slot);

   //Copy the multiple-precision integer to the SCM memory
   for(i = 0; i < length && i < 16; i++)
   {
      p[i] = src->data[i];
   }

   //Pad the operand with zeroes
   for(; i < 16; i++)
   {
      p[i] = 0;
   }
}


/**
 * @brief Export scalar
 * @param[out] dest Pointer to the scalar
 * @param[in] length Length of the scalar, in words
 * @param[in] slot SCM memory location
 * @return Error code
 **/

void ba414eExportScalar(uint32_t *dest, uint_t length, uint_t slot)
{
   uint_t i;
   volatile uint32_t *p;

   //Point to the specified SCM memory location
   p = BA414E_GET_SCM_SLOT(slot);

   //Copy the scalar from the SCM memory
   for(i = 0; i < length; i++)
   {
      dest[i] = p[i];
   }
}


/**
 * @brief Export multiple-precision integer
 * @param[out] dest Pointer to the multiple-precision integer
 * @param[in] slot SCM memory location
 * @return Error code
 **/

error_t ba414eExportMpi(Mpi *dest, uint_t slot)
{
   error_t error;
   uint_t i;
   uint_t length;
   volatile uint32_t *p;

   //Point to the specified SCM memory location
   p = BA414E_GET_SCM_SLOT(slot);

   //Skip trailing zeroes
   for(length = 16; length > 0 && p[length - 1] == 0; length--)
   {
   }

   //Ajust the size of the multiple precision integer
   error = mpiGrow(dest, length);

   //Check status code
   if(!error)
   {
      //Copy the multiple-precision integer from the SCM memory
      for(i = 0; i < length; i++)
      {
         dest->data[i] = p[i];
      }

      //Pad the resulting value with zeroes
      for(; i < dest->size; i++)
      {
         dest->data[i] = 0;
      }

      //Set the sign
      dest->sign = 1;
   }

   //Return status code
   return error;
}


#if (MPI_SUPPORT == ENABLED)

/**
 * @brief Modular exponentiation (regular calculation)
 * @param[out] r Resulting integer R = A ^ E mod P
 * @param[in] a Pointer to a multiple precision integer
 * @param[in] e Exponent
 * @param[in] p Modulus
 * @return Error code
 **/

error_t mpiExpModRegular(Mpi *r, const Mpi *a, const Mpi *e, const Mpi *p)
{
   error_t error;
   uint_t aLen;
   uint_t eLen;
   uint_t pLen;
   uint_t opSize;

   //Get the length of the integer, in words
   aLen = mpiGetLength(a);
   //Get the length of the exponent, in words
   eLen = mpiGetLength(e);
   //Get the length of the modulus, in words
   pLen = mpiGetLength(p);

   //The accelerator supports operand lengths up to 512 bits
   if(mpiIsOdd(p) && pLen <= 16 && aLen <= pLen && eLen <= pLen)
   {
      //Acquire exclusive access to the BA414E module
      osAcquireMutex(&pic32mzCryptoMutex);

      //Determine the size of the operands
      if(pLen <= 4)
      {
         opSize = PKCOMMAND_OPSIZE_128B;
      }
      else if(pLen <= 8)
      {
         opSize = PKCOMMAND_OPSIZE_256B;
      }
      else
      {
         opSize = PKCOMMAND_OPSIZE_512B;
      }

      //Clear the SCM memory
      ba414eClearScm();

      //Write all required parameters, operands and data into the SCM memory
      ba414eImportMpi(p, BA414E_RSA_MOD_EXP_SLOT_P);
      ba414eImportMpi(a, BA414E_RSA_MOD_EXP_SLOT_A);
      ba414eImportMpi(e, BA414E_RSA_MOD_EXP_SLOT_E);

      //Specify locations where operands are stored in the SCM memory
      PKCONFIG = (BA414E_RSA_MOD_EXP_SLOT_A << _PKCONFIG_OPPTRA_POSITION) |
         (BA414E_RSA_MOD_EXP_SLOT_E << _PKCONFIG_OPPTRB_POSITION) |
         (BA414E_RSA_MOD_EXP_SLOT_C << _PKCONFIG_OPPTRC_POSITION);

      //Specify the operation to be performed
      PKCOMMAND = _PKCOMMAND_CALCR2_MASK | PKCOMMAND_OP_RSA_MOD_EXP | opSize;

      //Set the START signal in the control register
      PKCONTROL = _PKCONTROL_START_MASK;

