Oryx-Embedded/CycloneCRYPTO/hardware/pic32mz/pic32mz_crypto_pkc.c
      //The START signal is automatically cleared when the operation is finished
      while((PKSTATUS & _PKSTATUS_BUSY_MASK) != 0)
      {
      }

      //Read the result from the SCM memory
      error = ba414eExportMpi(r, BA414E_RSA_MOD_EXP_SLOT_C);

      //Release exclusive access to the BA414E module
      osReleaseMutex(&pic32mzCryptoMutex);
   }
   else
   {
      //Perform modular exponentiation
      error = mpiExpMod(r, a, e, p);
   }

   //Return status code
   return error;
}

#endif
#if (EC_SUPPORT == ENABLED)

/**
 * @brief Scalar multiplication (fast calculation)
 * @param[in] curve Elliptic curve parameters
 * @param[out] r Resulting point R = d.S
 * @param[in] d An integer d such as 0 <= d < p
 * @param[in] s EC point
 * @return Error code
 **/

error_t ecMulFast(const EcCurve *curve, EcPoint3 *r, const uint32_t *d,
   const EcPoint3 *s)
{
   //Compute R = d.S
   return ecMulRegular(curve, r, d, s);
}


/**
 * @brief Scalar multiplication (regular calculation)
 * @param[in] curve Elliptic curve parameters
 * @param[out] r Resulting point R = d.S
 * @param[in] d An integer d such as 0 <= d < q
 * @param[in] s EC point
 * @return Error code
 **/

error_t ecMulRegular(const EcCurve *curve, EcPoint3 *r, const uint32_t *d,
   const EcPoint3 *s)
{
   error_t error;
   uint_t modLen;
   uint_t orderLen;
   uint_t opSize;

   //Get the length of the modulus, in words
   modLen = (curve->fieldSize + 31) / 32;
   //Get the length of the order, in words
   orderLen = (curve->orderSize + 31) / 32;

   //The accelerator supports operand lengths up to 512 bits
   if(modLen <= 4 && orderLen <= 4)
   {
      opSize = PKCOMMAND_OPSIZE_128B;
   }
   else if(modLen <= 8 && orderLen <= 8)
   {
      opSize = PKCOMMAND_OPSIZE_256B;
   }
   else if(modLen <= 16 && orderLen <= 16)
   {
      opSize = PKCOMMAND_OPSIZE_512B;
   }
   else
   {
      return ERROR_FAILURE;
   }

   //Acquire exclusive access to the BA414E module
   osAcquireMutex(&pic32mzCryptoMutex);

   //Clear the SCM memory
   ba414eClearScm();

   //Write all required parameters, operands and data into the SCM memory
   ba414eImportScalar(curve->p, modLen, BA414E_ECC_SLOT_P);
   ba414eImportScalar(curve->q, orderLen, BA414E_ECC_SLOT_N);
   ba414eImportScalar(curve->g.x, modLen, BA414E_ECC_SLOT_GX);
   ba414eImportScalar(curve->g.y, modLen, BA414E_ECC_SLOT_GY);
   ba414eImportScalar(curve->a, modLen, BA414E_ECC_SLOT_A);
   ba414eImportScalar(curve->b, modLen, BA414E_ECC_SLOT_B);
   ba414eImportScalar(s->x, modLen, BA414E_ECC_SLOT_P1X);
   ba414eImportScalar(s->y, modLen, BA414E_ECC_SLOT_P1Y);
   ba414eImportScalar(d, orderLen, BA414E_ECC_SLOT_K);

   //Specify locations where operands are stored in the SCM memory
   PKCONFIG = (BA414E_ECC_SLOT_P1X << _PKCONFIG_OPPTRA_POSITION) |
      (BA414E_ECC_SLOT_K << _PKCONFIG_OPPTRB_POSITION) |
      (BA414E_ECC_SLOT_P3X << _PKCONFIG_OPPTRC_POSITION);

   //Specify the operation to be performed
   PKCOMMAND = _PKCOMMAND_CALCR2_MASK | PKCOMMAND_OP_ECC_POINT_MUL | opSize;

   //Set the START signal in the control register
   PKCONTROL = _PKCONTROL_START_MASK;

   //The START signal is automatically cleared when the operation is finished
   while((PKSTATUS & _PKSTATUS_BUSY_MASK) != 0)
   {
   }

   //Point at the infinity?
   if((PKSTATUS & _PKSTATUS_PXINF_MASK) != 0)
   {
      //Set R = (1, 1, 0)
      ecScalarSetInt(r->x, 1, EC_MAX_MODULUS_SIZE);
      ecScalarSetInt(r->y, 1, EC_MAX_MODULUS_SIZE);
      ecScalarSetInt(r->z, 0, EC_MAX_MODULUS_SIZE);
   }
   else
   {
      //Copy the x-coordinate of the result
      ecScalarSetInt(r->x, 0, EC_MAX_MODULUS_SIZE);
      ba414eExportScalar(r->x, modLen, BA414E_ECC_SLOT_P3X);

      //Copy the y-coordinate of the result
      ecScalarSetInt(r->y, 0, EC_MAX_MODULUS_SIZE);
      ba414eExportScalar(r->y, modLen, BA414E_ECC_SLOT_P3Y);

      //Set the z-coordinate of the result
      ecScalarSetInt(r->z, 1, EC_MAX_MODULUS_SIZE);
   }

   //Release exclusive access to the BA414E module
   osReleaseMutex(&pic32mzCryptoMutex);

   //Successful processing
   return NO_ERROR;
}

#endif
#if (ECDSA_SUPPORT == ENABLED)

/**
 * @brief ECDSA signature generation
 * @param[in] prngAlgo PRNG algorithm
 * @param[in] prngContext Pointer to the PRNG context
 * @param[in] privateKey Signer's EC private key
 * @param[in] digest Digest of the message to be signed
 * @param[in] digestLen Length in octets of the digest
 * @param[out] signature (R, S) integer pair
 * @return Error code
 **/

error_t ecdsaGenerateSignature(const PrngAlgo *prngAlgo, void *prngContext,
   const EcPrivateKey *privateKey, const uint8_t *digest, size_t digestLen,
   EcdsaSignature *signature)
{
   error_t error;
   uint_t modLen;
   uint_t orderLen;
   uint_t opSize;
   uint32_t k[EC_MAX_ORDER_SIZE];
   const EcCurve *curve;

   //Check parameters
   if(privateKey == NULL || digest == NULL || signature == NULL)
      return ERROR_INVALID_PARAMETER;

   //Invalid elliptic curve?
   if(privateKey->curve == NULL)
      return ERROR_INVALID_ELLIPTIC_CURVE;

   //Get elliptic curve parameters
   curve = privateKey->curve;

   //Get the length of the modulus, in words
   modLen = (curve->fieldSize + 31) / 32;
   //Get the length of the order, in words
   orderLen = (curve->orderSize + 31) / 32;

   //The accelerator supports operand lengths up to 512 bits
   if(modLen <= 4 && orderLen <= 4)
   {
      opSize = PKCOMMAND_OPSIZE_128B;
   }
   else if(modLen <= 8 && orderLen <= 8)
   {
      opSize = PKCOMMAND_OPSIZE_256B;
   }
   else if(modLen <= 16 && orderLen <= 16)
   {
      opSize = PKCOMMAND_OPSIZE_512B;
   }
   else
   {
      return ERROR_FAILURE;
   }

   //Generate a random number k such as 0 < k < q - 1
   error = ecScalarRand(curve, k, prngAlgo, prngContext);

   //Check status code
   if(!error)
   {
      //Acquire exclusive access to the BA414E module
      osAcquireMutex(&pic32mzCryptoMutex);

      //Clear the SCM memory
      ba414eClearScm();

      //Write all required parameters, operands and data into the SCM memory
      ba414eImportScalar(curve->p, modLen, BA414E_ECDSA_SLOT_P);
      ba414eImportScalar(curve->q, orderLen, BA414E_ECDSA_SLOT_N);
      ba414eImportScalar(curve->g.x, modLen, BA414E_ECDSA_SLOT_GX);
      ba414eImportScalar(curve->g.y, modLen, BA414E_ECDSA_SLOT_GY);
      ba414eImportScalar(curve->a, modLen, BA414E_ECDSA_SLOT_A);
      ba414eImportScalar(curve->b, modLen, BA414E_ECDSA_SLOT_B);
      ba414eImportScalar(privateKey->d, orderLen, BA414E_ECDSA_SLOT_D);
      ba414eImportScalar(k, orderLen, BA414E_ECDSA_SLOT_K);

      //Keep the leftmost bits of the hash value
      digestLen = MIN(digestLen, (curve->orderSize + 7) / 8);
      //Load the hash value into the SCM memory
      ba414eImportArray(digest, digestLen, BA414E_ECDSA_SLOT_H);

      //Clear PKCONFIG register
      PKCONFIG = 0;
      //Specify the operation to be performed
      PKCOMMAND = _PKCOMMAND_CALCR2_MASK | PKCOMMAND_OP_ECDSA_SIGN_GEN | opSize;
      //Set the START signal in the control register
      PKCONTROL = _PKCONTROL_START_MASK;

