Oryx-Embedded/CycloneCRYPTO/hardware/pic32mz/pic32mz_crypto_pkc.c
      //The START signal is automatically cleared when the operation is finished
      while((PKSTATUS & _PKSTATUS_BUSY_MASK) != 0)
      {
      }

      //Check status register
      if((PKSTATUS & (_PKSTATUS_SIGINVAL_MASK | _PKSTATUS_CPLINVAL_MASK |
         _PKSTATUS_PXINF_MASK | _PKSTATUS_PXNOC_MASK)) == 0)
      {
         //Save elliptic curve parameters
         signature->curve = curve;

         //Copy integer R
         ecScalarSetInt(signature->r, 0, EC_MAX_ORDER_SIZE);
         ba414eExportScalar(signature->r, orderLen, BA414E_ECDSA_SLOT_R);

         //Copy integer S
         ecScalarSetInt(signature->s, 0, EC_MAX_ORDER_SIZE);
         ba414eExportScalar(signature->s, orderLen, BA414E_ECDSA_SLOT_S);
      }
      else
      {
         //Report an error
         error = ERROR_FAILURE;
      }

      //Release exclusive access to the BA414E module
      osReleaseMutex(&pic32mzCryptoMutex);
   }

   //Return status code
   return error;
}


/**
 * @brief ECDSA signature verification
 * @param[in] publicKey Signer's EC public key
 * @param[in] digest Digest of the message whose signature is to be verified
 * @param[in] digestLen Length in octets of the digest
 * @param[in] signature (R, S) integer pair
 * @return Error code
 **/

error_t ecdsaVerifySignature(const EcPublicKey *publicKey,
   const uint8_t *digest, size_t digestLen, const EcdsaSignature *signature)
{
   error_t error;
   uint_t modLen;
   uint_t orderLen;
   uint_t opSize;
   const EcCurve *curve;

   //Check parameters
   if(publicKey == NULL || digest == NULL || signature == NULL)
      return ERROR_INVALID_PARAMETER;

   //Invalid elliptic curve?
   if(publicKey->curve == NULL)
      return ERROR_INVALID_ELLIPTIC_CURVE;

   //Verify that the public key is on the curve
   if(!ecIsPointAffine(publicKey->curve, &publicKey->q))
   {
      return ERROR_INVALID_SIGNATURE;
   }

   //The verifier shall check that 0 < r < q
   if(ecScalarCompInt(signature->r, 0, EC_MAX_ORDER_SIZE) <= 0 ||
      ecScalarComp(signature->r, publicKey->curve->q, EC_MAX_ORDER_SIZE) >= 0)
   {
      //If the condition is violated, the signature shall be rejected as invalid
      return ERROR_INVALID_SIGNATURE;
   }

   //The verifier shall check that 0 < s < q
   if(ecScalarCompInt(signature->s, 0, EC_MAX_ORDER_SIZE) <= 0 ||
      ecScalarComp(signature->s, publicKey->curve->q, EC_MAX_ORDER_SIZE) >= 0)
   {
      //If the condition is violated, the signature shall be rejected as invalid
      return ERROR_INVALID_SIGNATURE;
   }

   //Get elliptic curve parameters
   curve = publicKey->curve;

   //Get the length of the modulus, in words
   modLen = (curve->fieldSize + 31) / 32;
   //Get the length of the order, in words
   orderLen = (curve->orderSize + 31) / 32;

   //The accelerator supports operand lengths up to 512 bits
   if(modLen <= 4 && orderLen <= 4)
   {
      opSize = PKCOMMAND_OPSIZE_128B;
   }
   else if(modLen <= 8 && orderLen <= 8)
   {
      opSize = PKCOMMAND_OPSIZE_256B;
   }
   else if(modLen <= 16 && orderLen <= 16)
   {
      opSize = PKCOMMAND_OPSIZE_512B;
   }
   else
   {
      return ERROR_FAILURE;
   }

   //Acquire exclusive access to the BA414E module
   osAcquireMutex(&pic32mzCryptoMutex);

   //Clear the SCM memory
   ba414eClearScm();

   //Write all required parameters, operands and data into the SCM memory
   ba414eImportScalar(curve->p, modLen, BA414E_ECDSA_SLOT_P);
   ba414eImportScalar(curve->q, orderLen, BA414E_ECDSA_SLOT_N);
   ba414eImportScalar(curve->g.x, modLen, BA414E_ECDSA_SLOT_GX);
   ba414eImportScalar(curve->g.y, modLen, BA414E_ECDSA_SLOT_GY);
   ba414eImportScalar(curve->a, modLen, BA414E_ECDSA_SLOT_A);
   ba414eImportScalar(curve->b, modLen, BA414E_ECDSA_SLOT_B);
   ba414eImportScalar(publicKey->q.x, modLen, BA414E_ECDSA_SLOT_QX);
   ba414eImportScalar(publicKey->q.y, modLen, BA414E_ECDSA_SLOT_QY);
   ba414eImportScalar(signature->r, orderLen, BA414E_ECDSA_SLOT_R);
   ba414eImportScalar(signature->s, orderLen, BA414E_ECDSA_SLOT_S);

   //Keep the leftmost bits of the hash value
   digestLen = MIN(digestLen, (curve->orderSize + 7) / 8);
   //Load the hash value into the SCM memory
   ba414eImportArray(digest, digestLen, BA414E_ECDSA_SLOT_H);

   //Clear PKCONFIG register
   PKCONFIG = 0;
   //Specify the operation to be performed
   PKCOMMAND = _PKCOMMAND_CALCR2_MASK | PKCOMMAND_OP_ECDSA_SIGN_VERIFY | opSize;
   //Set the START signal in the control register
   PKCONTROL = _PKCONTROL_START_MASK;

   //The START signal is automatically cleared when the operation is finished
   while((PKSTATUS & _PKSTATUS_BUSY_MASK) != 0)
   {
   }

   //Check status register
   if((PKSTATUS & (_PKSTATUS_SIGINVAL_MASK | _PKSTATUS_CPLINVAL_MASK |
      _PKSTATUS_PXINF_MASK | _PKSTATUS_PXNOC_MASK)) == 0)
   {
      error = NO_ERROR;
   }
   else
   {
      error = ERROR_INVALID_SIGNATURE;
   }

   //Release exclusive access to the BA414E module
   osReleaseMutex(&pic32mzCryptoMutex);

   //Return status code
   return error;
}

#endif
#if (X25519_SUPPORT == ENABLED)

/**
 * @brief X25519 function (scalar multiplication on Curve25519)
 * @param[out] r Output u-coordinate
 * @param[in] k Input scalar
 * @param[in] u Input u-coordinate
 * @return Error code
 **/

error_t x25519(uint8_t *r, const uint8_t *k, const uint8_t *u)
{
   volatile uint32_t *arg;

   //Acquire exclusive access to the BA414E module
   osAcquireMutex(&pic32mzCryptoMutex);

   //Clear the SCM memory
   ba414eClearScm();

   //Write the modulus into the SCM memory
   arg = BA414E_GET_SCM_SLOT(BA414E_CURVE25519_SLOT_P);
   arg[0] = 0xFFFFFFED;
   arg[1] = 0xFFFFFFFF;
   arg[2] = 0xFFFFFFFF;
   arg[3] = 0xFFFFFFFF;
   arg[4] = 0xFFFFFFFF;
   arg[5] = 0xFFFFFFFF;
   arg[6] = 0xFFFFFFFF;
   arg[7] = 0x7FFFFFFF;

   //Write the input u-coordinate into the SCM memory
   arg = BA414E_GET_SCM_SLOT(BA414E_CURVE25519_SLOT_X1);
   arg[0] = LOAD32LE(u);
   arg[1] = LOAD32LE(u + 4);
   arg[2] = LOAD32LE(u + 8);
   arg[3] = LOAD32LE(u + 12);
   arg[4] = LOAD32LE(u + 16);
   arg[5] = LOAD32LE(u + 20);
   arg[6] = LOAD32LE(u + 24);
   arg[7] = LOAD32LE(u + 28);

   //Implementations must mask the most significant bit in the final byte
   arg[7] &= 0x7FFFFFFF;

   //Write the pre-calculated value of (a - 2) / 4) into the SCM memory
   arg = BA414E_GET_SCM_SLOT(BA414E_CURVE25519_SLOT_A24);
   arg[0] = 121665;
   arg[1] = 0;
   arg[2] = 0;
   arg[3] = 0;
   arg[4] = 0;
   arg[5] = 0;
   arg[6] = 0;
   arg[7] = 0;

   //Write the scalar into the SCM memory
   arg = BA414E_GET_SCM_SLOT(BA414E_CURVE25519_SLOT_K);
   arg[0] = LOAD32LE(k);
   arg[1] = LOAD32LE(k + 4);
   arg[2] = LOAD32LE(k + 8);
   arg[3] = LOAD32LE(k + 12);
   arg[4] = LOAD32LE(k + 16);
   arg[5] = LOAD32LE(k + 20);
   arg[6] = LOAD32LE(k + 24);
   arg[7] = LOAD32LE(k + 28);

