Oryx-Embedded/CycloneCRYPTO/hardware/pic32mz/pic32mz_crypto_pkc.c
   //Set the three least significant bits of the first byte and the most
   //significant bit of the last to zero, set the second most significant
   //bit of the last byte to 1
   arg[0] &= 0xFFFFFFF8;
   arg[7] &= 0x7FFFFFFF;
   arg[7] |= 0x40000000;

   //Specify locations where operands are stored in the SCM memory
   PKCONFIG = (BA414E_CURVE25519_SLOT_X1 << _PKCONFIG_OPPTRA_POSITION) |
      (BA414E_CURVE25519_SLOT_K << _PKCONFIG_OPPTRB_POSITION) |
      (BA414E_CURVE25519_SLOT_X3 << _PKCONFIG_OPPTRC_POSITION);

   //Specify the operation to be performed
   PKCOMMAND = _PKCOMMAND_CALCR2_MASK | PKCOMMAND_OPSIZE_256B |
      PKCOMMAND_OP_CURVE25519_POINT_MUL;

   //Set the START signal in the control register
   PKCONTROL = _PKCONTROL_START_MASK;

   //The START signal is automatically cleared when the operation is finished
   while((PKSTATUS & _PKSTATUS_BUSY_MASK) != 0)
   {
   }

   //Read the result from the SCM memory
   arg = BA414E_GET_SCM_SLOT(BA414E_CURVE25519_SLOT_X3);
   STORE32LE(arg[0], r);
   STORE32LE(arg[1], r + 4);
   STORE32LE(arg[2], r + 8);
   STORE32LE(arg[3], r + 12);
   STORE32LE(arg[4], r + 16);
   STORE32LE(arg[5], r + 20);
   STORE32LE(arg[6], r + 24);
   STORE32LE(arg[7], r + 28);

   //Release exclusive access to the BA414E module
   osReleaseMutex(&pic32mzCryptoMutex);

   //Successful processing
   return NO_ERROR;
}

#endif
#if (ED25519_SUPPORT == ENABLED)

/**
 * @brief Scalar multiplication (regular calculation)
 * @param[in] state Pointer to the working state
 * @param[out] r Resulting point R = k * P
 * @param[in] k Input scalar
 * @param[in] p Input point
 **/

void ed25519Mul(Ed25519SubState *state, Ed25519Point *r,
   const uint8_t *k, const Ed25519Point *p)
{
   volatile uint32_t *arg;

   //Acquire exclusive access to the BA414E module
   osAcquireMutex(&pic32mzCryptoMutex);

   //Clear the SCM memory
   ba414eClearScm();

   //Write the modulus into the SCM memory
   arg = BA414E_GET_SCM_SLOT(BA414E_ED25519_SLOT_P);
   arg[0] = 0xFFFFFFED;
   arg[1] = 0xFFFFFFFF;
   arg[2] = 0xFFFFFFFF;
   arg[3] = 0xFFFFFFFF;
   arg[4] = 0xFFFFFFFF;
   arg[5] = 0xFFFFFFFF;
   arg[6] = 0xFFFFFFFF;
   arg[7] = 0x7FFFFFFF;

   //Write the pre-calculated value of D2 into the SCM memory
   arg = BA414E_GET_SCM_SLOT(BA414E_ED25519_SLOT_D2);
   arg[0] = 0xBE8FD3F4;
   arg[1] = 0x01DB17FD;
   arg[2] = 0x5F8C52E7;
   arg[3] = 0x21430EEF;
   arg[4] = 0x78310D20;
   arg[5] = 0xCB27240F;
   arg[6] = 0xE53F8A4D;
   arg[7] = 0x590456B4;

   //Write the x-coordinate of the input point into the SCM memory
   arg = BA414E_GET_SCM_SLOT(BA414E_ED25519_SLOT_PX);
   arg[0] = (p->x[1] << 29) | p->x[0];
   arg[1] = (p->x[2] << 26) | (p->x[1] >> 3);
   arg[2] = (p->x[3] << 23) | (p->x[2] >> 6);
   arg[3] = (p->x[4] << 20) | (p->x[3] >> 9);
   arg[4] = (p->x[5] << 17) | (p->x[4] >> 12);
   arg[5] = (p->x[6] << 14) | (p->x[5] >> 15);
   arg[6] = (p->x[7] << 11) | (p->x[6] >> 18);
   arg[7] = (p->x[8] << 8) | (p->x[7] >> 21);

   //Write the y-coordinate of the input point into the SCM memory
   arg = BA414E_GET_SCM_SLOT(BA414E_ED25519_SLOT_PY);
   arg[0] = (p->y[1] << 29) | p->y[0];
   arg[1] = (p->y[2] << 26) | (p->y[1] >> 3);
   arg[2] = (p->y[3] << 23) | (p->y[2] >> 6);
   arg[3] = (p->y[4] << 20) | (p->y[3] >> 9);
   arg[4] = (p->y[5] << 17) | (p->y[4] >> 12);
   arg[5] = (p->y[6] << 14) | (p->y[5] >> 15);
   arg[6] = (p->y[7] << 11) | (p->y[6] >> 18);
   arg[7] = (p->y[8] << 8) | (p->y[7] >> 21);

   //Write the scalar into the SCM memory
   arg = BA414E_GET_SCM_SLOT(BA414E_ED25519_SLOT_E);
   arg[0] = LOAD32LE(k);
   arg[1] = LOAD32LE(k + 4);
   arg[2] = LOAD32LE(k + 8);
   arg[3] = LOAD32LE(k + 12);
   arg[4] = LOAD32LE(k + 16);
   arg[5] = LOAD32LE(k + 20);
   arg[6] = LOAD32LE(k + 24);
   arg[7] = LOAD32LE(k + 28);

   //Specify locations where operands are stored in the SCM memory
   PKCONFIG = (BA414E_ED25519_SLOT_PX << _PKCONFIG_OPPTRA_POSITION) |
      (BA414E_ED25519_SLOT_E << _PKCONFIG_OPPTRB_POSITION) |
      (BA414E_ED25519_SLOT_CX << _PKCONFIG_OPPTRC_POSITION);

   //Specify the operation to be performed
   PKCOMMAND = _PKCOMMAND_CALCR2_MASK | PKCOMMAND_OPSIZE_256B |
      PKCOMMAND_OP_ED25519_SCALAR_MUL;

   //Set the START signal in the control register
   PKCONTROL = _PKCONTROL_START_MASK;

   //The START signal is automatically cleared when the operation is finished
   while((PKSTATUS & _PKSTATUS_BUSY_MASK) != 0)
   {
   }

   //Read the x-coordinate of the resulting point from the SCM memory
   arg = BA414E_GET_SCM_SLOT(BA414E_ED25519_SLOT_CX);
   r->x[0] = arg[0] & 0x1FFFFFFF;
   r->x[1] = (arg[0] >> 29) | ((arg[1] << 3) & 0x1FFFFFFF);
   r->x[2] = (arg[1] >> 26) | ((arg[2] << 6) & 0x1FFFFFFF);
   r->x[3] = (arg[2] >> 23) | ((arg[3] << 9) & 0x1FFFFFFF);
   r->x[4] = (arg[3] >> 20) | ((arg[4] << 12) & 0x1FFFFFFF);
   r->x[5] = (arg[4] >> 17) | ((arg[5] << 15) & 0x1FFFFFFF);
   r->x[6] = (arg[5] >> 14) | ((arg[6] << 18) & 0x1FFFFFFF);
   r->x[7] = (arg[6] >> 11) | ((arg[7] << 21) & 0x1FFFFFFF);
   r->x[8] = arg[7] >> 8;

   //Read the y-coordinate of the resulting point from the SCM memory
   arg = BA414E_GET_SCM_SLOT(BA414E_ED25519_SLOT_CY);
   r->y[0] = arg[0] & 0x1FFFFFFF;
   r->y[1] = (arg[0] >> 29) | ((arg[1] << 3) & 0x1FFFFFFF);
   r->y[2] = (arg[1] >> 26) | ((arg[2] << 6) & 0x1FFFFFFF);
   r->y[3] = (arg[2] >> 23) | ((arg[3] << 9) & 0x1FFFFFFF);
   r->y[4] = (arg[3] >> 20) | ((arg[4] << 12) & 0x1FFFFFFF);
   r->y[5] = (arg[4] >> 17) | ((arg[5] << 15) & 0x1FFFFFFF);
   r->y[6] = (arg[5] >> 14) | ((arg[6] << 18) & 0x1FFFFFFF);
   r->y[7] = (arg[6] >> 11) | ((arg[7] << 21) & 0x1FFFFFFF);
   r->y[8] = arg[7] >> 8;

   //Release exclusive access to the BA414E module
   osReleaseMutex(&pic32mzCryptoMutex);

   //Calculate extended point representation
   curve25519SetInt(r->z, 1);
   curve25519Mul(r->t, r->x, r->y);
}


/**
 * @brief Twin multiplication
 * @param[in] state Pointer to the working state
 * @param[out] r Resulting point R = k1 * P + k2 * Q
 * @param[in] k1 First input scalar
 * @param[in] p First input point
 * @param[in] k2 Second input scalar
 * @param[in] q Second input point
 **/

void ed25519TwinMul(Ed25519SubState *state, Ed25519Point *r,
   const uint8_t *k1, const Ed25519Point *p, const uint8_t *k2,
   const Ed25519Point *q)
{
   Ed25519Point p1;
   Ed25519Point p2;

   //Reduce non-canonical values
   curve25519Canonicalize(p1.x, p->x);
   curve25519Canonicalize(p1.y, p->y);
   curve25519Canonicalize(p2.x, q->x);
   curve25519Canonicalize(p2.y, q->y);

   //Compute R = k1 * P + k2 * Q
   ed25519Mul(state, &p1, k1, &p1);
   ed25519Mul(state, &p2, k2, &p2);
   ed25519Add(state, r, &p1, &p2);
}

#endif
#endif
